[{
  "_id": {
    "$oid": "5f955751e1a88a7267cc738e"
  },
  "title": "Dog Wears Her Owner's Pajamas",
  "story": "Molly has a habit of putting her folded pajamas under her pillow before making the bed. While she was still a pup, her dog Abby used to get really lonely in her absence, so she’d often jump onto the bed, drag Molly’s clothes out, and sleep on them in the hallway. Abby stopped doing this when she got older. However, recently, a career opportunity forced Molly to move to another town, so she had to leave Abby with her parents. She visits frequently, but her four-legged friend still misses her dearly. Last week, her parents called and told her how they had come home from the shops only to be greeted by Abby wearing her pajamas."
},{
  "_id": {
    "$oid": "5f9557ac19872dd76428fed8"
  },
  "title": "Muffins Are Her Dog’s Favorite Treat",
  "story": "Katrina’s dog’s favorite treat are muffins. She will do anything to get one, and when she has one, she won’t let anyone take it away from her. A few days ago, Katrina came back from work late and utterly exhausted. Dragging her feet, she entered her apartment, collapsed on the sofa and began to sob. Suddenly, her dog ran up to her and started licking her hands, and poking her face with her nose. Oblivious, Katrina just kept on crying. Then her dog left her alone for a few minutes and returned, carrying a muffin in her jaws. She put it in front of Katrina and sat down by the sofa, waiting for her to calm down."
},{
  "_id": {
    "$oid": "5f9557ce19872dd76428fed9"
  },
  "title": "Dogs Saves Pet Tortoise",
  "story": "Last month, there was a fire at Sam’s apartment. Thankfully, Sam, his family, and their pet dog managed to get out in time. However, once safely outside, it occurred to Sam that they’d left their pet tortoise behind. Then Sam looked at his dog, and saw him holding the tortoise gently in his mouth. When it comes down to friendship, animals can really teach us a thing or two."
},{
  "_id": {
    "$oid": "5f9557fc19872dd76428feda"
  },
  "title": "Dog Buys Groceries at the Store for His Owner",
  "story": "Grant runs a small grocery shop, and one of his regulars is a Royal Poodle called Albert. He belongs to an old lady who finds it hard to walk. Every day, Albert trots into the store, gets in line, and waits patiently for his turn at the counter, holding a small package in his mouth. The package contains some money, a shopping list, and a string bag. All Grant needs to do is take the money, fill the bag with goods, and give it back to the dog."
},{
  "_id": {
    "$oid": "5f95582e19872dd76428fedb"
  },
  "title": "Dog Saves Girl from Strays",
  "story": "Emma has a Dalmatian called Sammy. When he was seven months old, they went for a walk in the park. Suddenly, for no reason at all, Sammy darted into one of the side alleys. Emma followed him and the scene that opened before her eyes made her freeze: Sammy was sitting by the side of the walkway, pressing a girl of about six into the floral hedge with his back. Standing before him were several large stray dogs, and Sammy was growling at them. Emma felt really scared, but she grabbed a stick and tried to chase the strays away. Finally, they retreated, leaving Emma standing with the little girl clutching one of her legs. Later the girl told Emma that the strays rushed at her, but then Sammy appeared out of nowhere to protect her."
},{
  "_id": {
    "$oid": "5f95585d19872dd76428fedc"
  },
  "title": "Dog Recognizes Gas Leak in the House",
  "story": "Amber found her dog Suzie at a kennel, where she languished in the “total rejects” category. A beautiful red-coated Pinscher with intelligent eyes, she kept utterly silent. Things didn’t change when she took her home. If Suzie wanted something, she used to express it by constantly running from one room to another. Then, one night, when Amber was half-asleep in her bed, she heard muffled barking coming somewhere seemingly far away. Amber couldn’t lift her eyelids – it seemed like the whole world was weighing down on them. Finally, with great difficulty, she woke up and saw that it was Suzie barking. Then she realized that there was a gas leak in the house. Without Suzie, Amber would have fallen asleep and never woken up."
}]